espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32TG11B/Include/efm32tg11b340f64iq48.h
/***************************************************************************//**
 * @file
 * @brief CMSIS Cortex-M Peripheral Access Layer Header File
 *        for EFM32TG11B340F64IQ48
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

#ifndef EFM32TG11B340F64IQ48_H
#define EFM32TG11B340F64IQ48_H

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @defgroup EFM32TG11B340F64IQ48 EFM32TG11B340F64IQ48
 * @{
 ******************************************************************************/

/** Interrupt Number Definition */
typedef enum IRQn{
/******  Cortex-M0P Processor Exceptions Numbers *******************************************/
  NonMaskableInt_IRQn = -14,                /*!< 2  Cortex-M0P Non Maskable Interrupt      */
  HardFault_IRQn      = -13,                /*!< 3  Cortex-M0P Hard Fault Interrupt        */
  SVCall_IRQn         = -5,                 /*!< 11 Cortex-M0P SV Call Interrupt           */
  PendSV_IRQn         = -2,                 /*!< 14 Cortex-M0P Pend SV Interrupt           */
  SysTick_IRQn        = -1,                 /*!< 15 Cortex-M0P System Tick Interrupt       */

/******  EFM32TG11B Peripheral Interrupt Numbers *******************************************/
  EMU_IRQn            = 0,  /*!< 16+0 EFM32 EMU Interrupt */
  WDOG0_IRQn          = 1,  /*!< 16+1 EFM32 WDOG0 Interrupt */
  LDMA_IRQn           = 2,  /*!< 16+2 EFM32 LDMA Interrupt */
  GPIO_EVEN_IRQn      = 3,  /*!< 16+3 EFM32 GPIO_EVEN Interrupt */
  SMU_IRQn            = 4,  /*!< 16+4 EFM32 SMU Interrupt */
  TIMER0_IRQn         = 5,  /*!< 16+5 EFM32 TIMER0 Interrupt */
  USART0_IRQn         = 6,  /*!< 16+6 EFM32 USART0 Interrupt */
  ACMP0_IRQn          = 7,  /*!< 16+7 EFM32 ACMP0 Interrupt */
  ADC0_IRQn           = 8,  /*!< 16+8 EFM32 ADC0 Interrupt */
  I2C0_IRQn           = 9,  /*!< 16+9 EFM32 I2C0 Interrupt */
  I2C1_IRQn           = 10, /*!< 16+10 EFM32 I2C1 Interrupt */
  GPIO_ODD_IRQn       = 11, /*!< 16+11 EFM32 GPIO_ODD Interrupt */
  TIMER1_IRQn         = 12, /*!< 16+12 EFM32 TIMER1 Interrupt */
  USART1_IRQn         = 13, /*!< 16+13 EFM32 USART1 Interrupt */
  USART2_IRQn         = 14, /*!< 16+14 EFM32 USART2 Interrupt */
  UART0_IRQn          = 15, /*!< 16+15 EFM32 UART0 Interrupt */
  LEUART0_IRQn        = 16, /*!< 16+16 EFM32 LEUART0 Interrupt */
  LETIMER0_IRQn       = 17, /*!< 16+17 EFM32 LETIMER0 Interrupt */
  PCNT0_IRQn          = 18, /*!< 16+18 EFM32 PCNT0 Interrupt */
  RTCC_IRQn           = 19, /*!< 16+19 EFM32 RTCC Interrupt */
  CMU_IRQn            = 20, /*!< 16+20 EFM32 CMU Interrupt */
  MSC_IRQn            = 21, /*!< 16+21 EFM32 MSC Interrupt */
  CRYPTO0_IRQn        = 22, /*!< 16+22 EFM32 CRYPTO0 Interrupt */
  CRYOTIMER_IRQn      = 23, /*!< 16+23 EFM32 CRYOTIMER Interrupt */
  USART3_IRQn         = 24, /*!< 16+24 EFM32 USART3 Interrupt */
  WTIMER0_IRQn        = 25, /*!< 16+25 EFM32 WTIMER0 Interrupt */
  WTIMER1_IRQn        = 26, /*!< 16+26 EFM32 WTIMER1 Interrupt */
  VDAC0_IRQn          = 27, /*!< 16+27 EFM32 VDAC0 Interrupt */
  CSEN_IRQn           = 28, /*!< 16+28 EFM32 CSEN Interrupt */
  LESENSE_IRQn        = 29, /*!< 16+29 EFM32 LESENSE Interrupt */
  LCD_IRQn            = 30, /*!< 16+30 EFM32 LCD Interrupt */
  CAN0_IRQn           = 31, /*!< 16+31 EFM32 CAN0 Interrupt */
} IRQn_Type;

/***************************************************************************//**
 * @defgroup EFM32TG11B340F64IQ48_Core Core
 * @{
 * @brief Processor and Core Peripheral Section
 ******************************************************************************/
#define __MPU_PRESENT             1U /**< Presence of MPU  */
#define __VTOR_PRESENT            1U /**< Presence of VTOR register in SCB */
#define __NVIC_PRIO_BITS          2U /**< NVIC interrupt priority bits */
#define __Vendor_SysTickConfig    0U /**< Is 1 if different SysTick counter is used */

/** @} End of group EFM32TG11B340F64IQ48_Core */

/***************************************************************************//**
 * @defgroup EFM32TG11B340F64IQ48_Part Part
 * @{
 ******************************************************************************/

/** Part family */
#define _EFM32_TINY_FAMILY                       1   /**< Tiny Gecko MCU Family  */
#define _EFM_DEVICE                                  /**< Silicon Labs EFM-type MCU */
#define _SILICON_LABS_32B_SERIES_1                   /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES                 1   /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES_1_CONFIG_1          /**< Series 1, Configuration 1 */
#define _SILICON_LABS_32B_SERIES_1_CONFIG        1   /**< Series 1, Configuration 1 */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_103        /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_GECKO_INTERNAL_SDID        103 /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_32B_PLATFORM_2                 /**< Silicon Labs platform name */
#define _SILICON_LABS_32B_PLATFORM               2   /**< Silicon Labs platform name */
#define _SILICON_LABS_32B_PLATFORM_2_GEN_1           /**< @deprecated Platform 2, generation 1 */
#define _SILICON_LABS_32B_PLATFORM_2_GEN         1   /**< @deprecated Platform 2, generation 1 */

